src/Catalogs/ТипыЗадачКонтрольПамяти/ТипыЗадачКонтрольПамяти.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыЗадачКонтрольПамяти</name>
  <predefined>
    <items>
      <name>НедоступенКластер</name>
      <description>Восстановить доступность кластера 1с</description>
    </items>
    <items>
      <name>ПревышенПорогПотребленияПамяти</name>
      <description>Устранить причины превышения порога потребления памяти</description>
    </items>
  </predefined>
  <attributes>
    <name>ОповещатьПриКаждомИнциденте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПериодОповещенияСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПриВыполнении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПредупреждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйТекстПредупреждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПервойРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПовторнойРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ТипыЗадачКонтрольПамяти/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПолучитьОсновнойШаблон(Команда)
	Объект.ДополнительныйТекстПредупреждения = ПолучитьОсновнойШаблонНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьШаблонПервойРегистрации(Команда)
	Объект.ШаблонПервойРегистрации = ПолучитьШаблонПервойРегистрацииНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьШаблонПовторнойРегистрации(Команда)
	Объект.ШаблонПовторнойРегистрации = ПолучитьШаблонПовторнойРегистрацииНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОсновнойШаблонНаСервере(Ссылка)
	Если Ссылка = Справочники.ТипыЗадачКонтрольПамяти.ПревышенПорогПотребленияПамяти Тогда
		Возврат Справочники.ТипыЗадачКонтрольПамяти.ПолучитьОсновнойШаблонПревышенПорогПотребленияПамяти();
	ИначеЕсли Ссылка = Справочники.ТипыЗадачКонтрольПамяти.НедоступенКластер Тогда
		Возврат Справочники.ТипыЗадачКонтрольПамяти.ПолучитьОсновнойШаблонНедоступенКластер();
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьШаблонПервойРегистрацииНаСервере(Ссылка)
	Если Ссылка = Справочники.ТипыЗадачКонтрольПамяти.ПревышенПорогПотребленияПамяти Тогда
		Возврат Справочники.ТипыЗадачКонтрольПамяти.ПолучитьШаблонПервойРегистрацииПревышенПорогПотребленияПамяти();
	ИначеЕсли Ссылка = Справочники.ТипыЗадачКонтрольПамяти.НедоступенКластер Тогда
		Возврат Справочники.ТипыЗадачКонтрольПамяти.ПолучитьШаблонПервойРегистрацииНедоступенКластер();
	КонецЕсли;	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьШаблонПовторнойРегистрацииНаСервере(Ссылка)
	Если Ссылка = Справочники.ТипыЗадачКонтрольПамяти.ПревышенПорогПотребленияПамяти Тогда
		Возврат Справочники.ТипыЗадачКонтрольПамяти.ПолучитьШаблонПовторнойРегистрацииПревышенПорогПотребленияПамяти();
	ИначеЕсли Ссылка = Справочники.ТипыЗадачКонтрольПамяти.НедоступенКластер Тогда
		Возврат Справочники.ТипыЗадачКонтрольПамяти.ПолучитьШаблонПовторнойРегистрацииНедоступенКластер();
	КонецЕсли;
КонецФункции
